BAS BMEKZU Project/src/Catalogs/УдалитьИНАГРО_ВнешнееОборудование/УдалитьИНАГРО_ВнешнееОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьИНАГРО_ВнешнееОборудование</name>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайлаДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвоДатчиков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкоростьПорт1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкоростьПорт2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвоБитДанныхВБайтеПорт1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвоБитДанныхВБайтеПорт2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПроверкиПарностиПорт1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПроверкиПарностиПорт2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвоКонечныхБитПорт1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвоКонечныхБитПорт2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтролераВСетиПорт1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтролераВСетиПорт2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегистрацииКонтроллераПорт1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегистрацииКонтроллераПорт2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстройстваПорт1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУстройстваПорт2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКФайлуИсточнику</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьМодально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыВнешнегоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВесов</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключатьПоIP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыВызова</name>
    <attributes>
      <name>БруттоТараЖД</name>
      <type>
        <types>EnumRef.ИНАГРО_ВидыВзвешиванийНаВесах</types>
      </type>
    </attributes>
    <attributes>
      <name>IP</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Режим</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыВнешнегоОборудования/ИНАГРО_ВидыВнешнегоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыВнешнегоОборудования</name>
  <enumValues>
    <name>Весы</name>
  </enumValues>
  <enumValues>
    <name>Камера</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/УдалитьИНАГРО_ВнешнееОборудование/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодключатьПоIPПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КвоДатчиковПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФайлДрайвераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьФайл(Элемент, "dll");
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	ВыбратьФайл(Элемент, "epf");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыРазделы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если Объект.ВидОборудования = ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыВнешнегоОборудования.Весы")
		И НЕ Объект.ПодключатьПоIP Тогда
		
		Элементы.ГруппаНастройкаПортов.Видимость = Истина;
		Элементы.ГруппаНастройкиПодключенияПоIP.Видимость = Ложь;		
			
		Если Объект.КвоДатчиков = 1 Тогда
			Элементы.ГруппаПорт2.Видимость = Ложь;	
		ИначеЕсли Объект.КвоДатчиков = 2 Тогда
			Элементы.ГруппаПорт2.Видимость = Истина;
		КонецЕсли;		
		
	ИначеЕсли Объект.ВидОборудования = ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыВнешнегоОборудования.Весы")
		И Объект.ПодключатьПоIP Тогда
		
		Элементы.ГруппаНастройкаПортов.Видимость = Ложь;
		Элементы.ГруппаНастройкиПодключенияПоIP.Видимость = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Элемент, ТипФайла)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ТипФайла="epf" Тогда
		ДиалогОткрытияФайла.Фильтр=НСтр("ru='Файл внешней обработки(*.epf)|*.epf';uk='Файл зовнішньої обробки (*.epf)|*.epf'");
		ДиалогОткрытияФайла.Расширение ="epf";
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
	ИначеЕсли ТипФайла="dll" Тогда
		ДиалогОткрытияФайла.Фильтр=НСтр("ru='Файл динамической библиотеки(*.dll)|*.dll';uk='Файл динамічної бібліотеки(*.dll)|*.dll'");
		ДиалогОткрытияФайла.Расширение ="epf";
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлДрайвера;
	КонецЕсли;
	
	ДиалогОткрытияФайла.Заголовок=НСтр("ru='Выберите файл';uk='Виберіть файл'");
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Ложь;
	ДиалогОткрытияФайла.ИндексФильтра = 0;
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Если ТипФайла="epf" Тогда
			Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		ИначеЕсли ТипФайла="dll" Тогда
			Объект.ФайлДрайвера = ДиалогОткрытияФайла.ПолноеИмяФайл;
		КонецЕсли;              
		//Объект.КаталогФайлаДрайвера = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
